Revit 2027 API
BuiltInFailures.RoofFailures.CurveRoofSkippedLoops Property
 Some loops were skipped
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveRoofSkippedLoops { get; }
Public Shared ReadOnly Property CurveRoofSkippedLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveRoofSkippedLoops {
	FailureDefinitionId^ get ();
}
static member CurveRoofSkippedLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace